# Conduit Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Conduit Class
Members See Also
---
This class represents a conduit in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Conduit : CableTrayConduitBase
```

Visual Basic
---
```text
Public Class Conduit _
	Inherits CableTrayConduitBase
```

Visual C++
---
```text
public ref class Conduit : public CableTrayConduitBase
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..MEPCurve Autodesk.Revit.DB.Electrical..::..CableTrayConduitBase Autodesk.Revit.DB.Electrical..::..Conduit
# See Also
Conduit Members
Autodesk.Revit.DB.Electrical Namespace